{
  "publications": [
    "Rohit Ghatikar, Nithin M (2021),  ‘Design of high speed 2-stage OTA for high capacitive load of 120pF and 2.96V’, Volume 3, Number 4, Engineering Research Express.",
    "Gopal Kanase, Nithin M (2021), ‘ASIC Design of a 32-bit Low Power RISC-V based System Core for Medical Applications’, 6th International Conference on Communication and Electronics Systems (ICCES), Coimbatore, India.",
    "Pampapathi Yanna, Jeetpal Singh Chhabra and Nithin M (2021), ‘Improving Quality of Manufacturing Test using Cell-Aware ATPG’, Journal of University of Shanghai for Science and Technology ISSN: 1007-6735",
    "Abhinav S, Nithin Kumar BG, Nithin M (2021), ‘Development of Accurate Techniques for Design of Trans Impedance Amplifiers’, Vol 34, Issue 6, Gorteria Journal.",
    "Nithin, M. and Harish, M. Kittur (2020), ‘Design of On Chip Spiral Inductors for Millimeter Wave Frequency Synthesizers’, International Journal of Circuits, Systems and Signal Processing 14, 191–196.",
    "Nithin, M. and Harish, M. Kittur. (2020), Phase Locking Approaches in Millimeter Wave Frequency Synthesizers: Design overview of Charge Pump Phase Locked Loops’, WSEAS Transactions on Circuits and Systems 19, 129–142.",
    "Nithin, M. and Harish, M. Kittur. (2019), ‘Design of Beyond Millimeter Wave Voltage Controlled Oscillator in 22 nm Bulk CMOS technology’, 2nd World Summit on Advances in Science, Engineering and Technology jointly with Indiana University - Purdue University (IUPUI), Indianapolis, Indiana, USA October 3-5, 2019",
    "Nithin, M. and Harish, M. Kittur. (2019), ‘Design of Beyond Millimeter Wave Oscillator in 22 nm Bulk CMOS technology’, International Journal of Engineering and Advanced Technology 9, 68–72.",
    "Shravan Ramesh, Nithin, M. and Harish, M. Kittur. (2019), ‘Design of Millimeter Wave LC Oscillators for 5G Applications’, 8th International Conference on Communication and Signal Processing, April 4-6, 2019, ICCSP 2019",
    "Shanchana S, Nithyashree S, Aishwarya M, Sanjana S , Nithin, M. and Harish, M. Kittur (2018), Systematic Design and Analysis of Split Length Compensated Op-Amp Using gm/ID Technique’, 7 th International Conference on Communication and Signal Processing, April 4-6, 2018, ICCSP 2018",
    "M Vineeth Bhat, Siddanth Jain, Srivatsa M P, Nithin, M. and Harish, M. Kittur  (2017), Design of low phase noise voltage controlled oscillator for phase locked loop’, presented in International conference on Microelectronic Devices, Circuits and Systems (ICMDCS 2017).",
    "B N Aiyappa, Meghna Madhusudan, Yashaswini B, Yatish R, Nithin M (2017), Amplifier Design in Weak Inversion and Strong Inversion – A Case Study, 6 th International Conference on Communication and Signal Processing, April 6-8, 2017, ICCSP 2017",
    "Arshath Sheeparamatti, M Vineeth Bhat, Srivatsa M P, Nithin M (2017), ‘Design of 3.3V Rail To Rail Operational Amplifier for High Resolution ADC Driver Amplifier’, presented in International Conference on Innovative Mechanisms for Industry Applications (ICIMIA 2017)",
    "Adarsh HC, Nithin M, (2015) “Scaling Challenges in CMOS Technology”, International Journal of Advance Research in Engineering Science & Technology, ISSN (Online)2393-9877, Vol2, Issue 6, June 2015",
    "Nithin M, Ravi S, (2014)“Oversampling Approaches in A/D Converters : Design Overview of Sigma Delta Modulator,” International Conference on Emerging Trends in Science, Engineering &amp; Disaster Management, ICBDM 2014 (IEEE Sponsored) held on 28 th February 2014 at Noorul Islam University, Kumaracoil, Tamil Nadu. (published in the Journal of Emerging Technologies Volume 8, Special Issue III Feb 2014).",
    "Nithin, M. and Harish, M. Kittur, Ravi .S, Arun .J, Ezra .K (2014), Design and Analysis of Charge Pump Phase Locked Loop in 180 nm CMOS Technology’, in International Review of Applied Engineering Research, 4(2), pp. 207–222",
    "Arun J, Ezra K, Nithin M, Ravi S (2013) Design and analysis of double balanced Gilbert cell CMOS mixer for heterodyne receivers, International Journal of Applied Engineering Research 8(19):2413-2416",
    "Nithin M, Arun J , Jeniba Baswam (2013)“Design  and Analysis of Sample & Hold Circuits in 0.18 µm CMOS Technology,” 5 th NationalConference on Signal Processing, Communications and VLSI Design, NCSCV 2013(IEEE Sponsored) held on 10 th and 11 th May 2013 at Anna University Regional Centre,Coimbatore, Tamil Nadu.",
    "Nithin M , Arun J , Ravi S,(2012) “High Performance Low Power ALU Design,” 5 th International Conference on Science Engineering & Technology, SET 2012 held on 8 th and 9 th of November 2012 at VITUniversity, Vellore, Tamil Nadu."
  ],
  "awards": [
    "Secured Second Rank in M Tech VLSI Design from VIT, Vellore May 2014",
    "Awarded merit scholarship of VIT University for Best Academic Performance in the year 2012-13 & 2013-14",
    "Best paper award for the paper “High performance Low power ALU Design” in the 5th International Conference on Science Engineering & Technology Nov 8-9, 2012",
    "Selected in the top 5 (Master’s category) in Cadence Design Contest 2013"
  ]
}
